app/CentralLogics/helpers.php

select * from `business_settings` where (`key` = 'schedule_order') limit 1
---
    public static function schedule_order()
    {
        return (bool)BusinessSetting::where(['key' => 'schedule_order'])->first()?->value;

select * from `restaurants` where `restaurants`.`id` = 150 limit 1
select `cuisines`.*, `cuisine_restaurant`.`restaurant_id` as `pivot_restaurant_id`, `cuisine_restaurant`.`cuisine_id` as `pivot_cuisine_id` from `cuisines` inner join `cuisine_restaurant` on `cuisines`.`id` = `cuisine_restaurant`.`cuisine_id` where `cuisine_restaurant`.`restaurant_id` in (150)
---
                $item['min_delivery_time'] =  (int) explode('-',$item->restaurant->delivery_time)[0] ?? 0;
                $item['max_delivery_time'] =  (int) explode('-',$item->restaurant->delivery_time)[1] ?? 0;
                $cuisine =[];
                $cui =$item->restaurant->load('cuisine');

select `cuisines`.*, `cuisine_restaurant`.`restaurant_id` as `pivot_restaurant_id`, `cuisine_restaurant`.`cuisine_id` as `pivot_cuisine_id` from `cuisines` inner join `cuisine_restaurant` on `cuisines`.`id` = `cuisine_restaurant`.`cuisine_id` where `cuisine_restaurant`.`restaurant_id` in (2)
---
    public static function restaurant_data_formatting($data, $multi_data = false)
    {
        $storage = [];
        $cuisines=[];

        if ($multi_data == true) {
            foreach ($data as $item) {
                $item->load('cuisine');
                // $item['coupons'] = $item->coupon_valid;
                $restaurant_id= (string)$item->id;

                $item['coupons'] = Coupon::Where(function ($q) use ($restaurant_id) {
                    $q->Where('coupon_type', 'restaurant_wise')->whereJsonContains('data', [$restaurant_id])
                        ->where(function ($q1)  {
                            $q1->WhereJsonContains('customer_id', ['all']);
                        });
                })->orwhere('restaurant_id',$restaurant_id)
                ->active()
                ->valid()
                ->get();

select `id` from `zones` where ST_CONTAINS(`coordinates`, ST_GeomFromText('POINT(73.031529039145 19.162483671799)', 0, 'axis-order=long-lat')) order by `created_at` desc
---
    public static function address_data_formatting($data)
    {
        foreach ($data as $key=>$item) {
            $data[$key]['zone_ids'] = array_column(Zone::query()->whereContains('coordinates', new Point($item->latitude, $item->longitude, POINT_SRID))->latest()->get(['id'])->toArray(), 'id');

select * from `business_settings` where `key` = 'fcm_credentials' limit 1
---
    public static function get_business_settings($name, $json_decode = true)
    {
        $config = null;

        $paymentmethod = BusinessSetting::where('key', $name)->first();

select * from `business_settings` where (`key` = 'currency') limit 1
---
    public static function currency_code()
    {
        if(!request()->is('/api*') && !session()->has('currency_code')){
            $currency = BusinessSetting::where(['key' => 'currency'])->first()?->value;

select * from `business_settings` where (`key` = 'push_notification_key') limit 1
---
    public static function send_push_notif_to_device($fcm_token, $data, $web_push_link = null)
    {
        $key = BusinessSetting::where(['key' => 'push_notification_key'])->first()->value;

select * from `notification_messages` where `key` = 'order_handover_message' limit 1
---
    public static function order_status_update_message($status, $lang='default')
    {
        if ($status == 'pending') {
            $data = NotificationMessage::with(['translations'=>function($query)use($lang){
                $query->where('locale', $lang);
            }])->where('key', 'order_pending_message')->first();
        } elseif ($status == 'confirmed') {
            $data =  NotificationMessage::with(['translations'=>function($query)use($lang){
                $query->where('locale', $lang);
            }])->where('key', 'order_confirmation_msg')->first();
        } elseif ($status == 'processing') {
            $data = NotificationMessage::with(['translations'=>function($query)use($lang){
                $query->where('locale', $lang);
            }])->where('key', 'order_processing_message')->first();
        } elseif ($status == 'picked_up') {
            $data = NotificationMessage::with(['translations'=>function($query)use($lang){
                $query->where('locale', $lang);
            }])->where('key', 'out_for_delivery_message')->first();
        } elseif ($status == 'handover') {
            $data = NotificationMessage::with(['translations'=>function($query)use($lang){
                $query->where('locale', $lang);
            }])->where('key', 'order_handover_message')->first();

select * from `orders` where `id` = 120097 limit 1
select `id`, `deliveryman_wise_topic` from `zones` where `zones`.`id` in (3)
select `id`, `firebase_token` from `vendors` where `vendors`.`id` in (10)
select `id`, `name`, `restaurant_model`, `self_delivery_system`, `vendor_id` from `restaurants` where `restaurants`.`id` in (10)
---
    public static function send_order_notification($order)
    {
        $order= Order::where('id',$order->id)->with('zone:id,deliveryman_wise_topic','restaurant:id,name,restaurant_model,self_delivery_system,vendor_id','restaurant.restaurant_sub','customer:id,cm_firebase_token,email,f_name,l_name','restaurant.vendor:id,firebase_token','delivery_man:id,fcm_token')->first();

insert into `user_notifications` (`data`, `delivery_man_id`, `created_at`, `updated_at`) values ('{\"title\":\"Order\",\"description\":\"Ready for delivery\",\"order_id\":120097,\"image\":\"\",\"type\":\"order_status\"}', 6, '2023-12-06 16:51:22', '2023-12-06 16:51:22')
---
                    'type' => 'order_status'
                ];
                self::send_push_notif_to_device($order->delivery_man->fcm_token, $data);
                DB::table('user_notifications')->insert([
                    'data' => json_encode($data),
                    'delivery_man_id' => $order->delivery_man->id,
                    'created_at' => now(),
                    'updated_at' => now()
                ]);

select exists(select * from `users` where `ref_code` = 'AFLGNC4GMH') as `exists`
---
    public static function referer_code_exists($ref_code) {
        return User::where('ref_code', '=', $ref_code)->exists();

select * from `business_settings` where `key` = 'business_model' limit 1
---
    public static function get_varient(array $product_variations, array $variations)
    {
        $result = [];
        $variation_price = 0;

        foreach($variations as $k=> $variation){
            foreach($product_variations as  $product_variation){
                if( isset($variation['values']) && isset($product_variation['values']) && $product_variation['name'] == $variation['name']  ){
                    $result[$k] = $product_variation;
                    $result[$k]['values'] = [];
                    foreach($product_variation['values'] as $key=> $option){
                        if(in_array($option['label'], $variation['values']['label'])){
                            $result[$k]['values'][] = $option;
                            $variation_price += $option['optionPrice'];
                        }
                    }
                }
            }
        }

        return ['price'=>$variation_price,'variations'=>$result];
    }




    public Static function subscription_check()
    {
        $business_model= BusinessSetting::where('key', 'business_model')->first();

select * from `business_settings` where `key` = 'business_model' limit 1
---

    public Static function commission_check()
    {
        $business_model= BusinessSetting::where('key', 'business_model')->first();

select * from `business_settings` where `key` = 'check_subscription_validity_on' limit 1
---
    public static function check_subscription_validity()
    {
        $current_date = date('Y-m-d');
        $check_subscription_validity_on= BusinessSetting::where('key', 'check_subscription_validity_on')->first();

update `visitor_logs` set `visit_count` = visit_count + 1, `order_count` = order_count, `created_at` = '2023-12-06 19:40:12', `updated_at` = '2023-12-06 19:40:12' where (`visitor_log_type` = 'App\Models\Restaurant' and `user_id` = 261 and `visitor_log_id` = 57) limit 1
---
    public static function visitor_log($model,$user_id,$visitor_log_id,$order_count=false){
            if( $model == 'restaurant' ){
                $visitor_log_type = 'App\Models\Restaurant';
            }
            else {
                $visitor_log_type = 'App\Models\Category';
            }
        VisitorLog::updateOrInsert(
            ['visitor_log_type' => $visitor_log_type,
                'user_id' => $user_id,
                'visitor_log_id' => $visitor_log_id,
            ],
            [
                'visit_count' => $order_count == false ? DB::raw('visit_count + 1') : DB::raw('visit_count'),
                'order_count' =>  $order_count == true ? DB::raw('order_count + 1') : DB::raw('order_count'),
                'created_at' => now(),
                'updated_at' => now(),
            ]
        );

select * from `vehicles` where `status` = 1 and (`starting_coverage_area` <= 0 and `maximum_coverage_area` >= 0 or (`starting_coverage_area` >= 0)) order by `starting_coverage_area` asc limit 1
---
    public static function vehicle_extra_charge(float $distance_data) {
        $data =[];
        $vehicle = Vehicle::active()
        ->where(function ($query) use ($distance_data) {
            $query->where('starting_coverage_area', '<=', $distance_data)->where('maximum_coverage_area', '>=', $distance_data)
            ->orWhere(function ($query) use ($distance_data) {
                $query->where('starting_coverage_area', '>=', $distance_data);
            });
        })->orderBy('starting_coverage_area')->first();

select * from `business_settings` where `key` = 'place_order_mail_status_user' limit 1
---
    public static function get_mail_status($name)
    {
        $status = 0;

        $mail = BusinessSetting::where('key', $name)->first();