app/CentralLogics/helpers.php

    public static function restaurant_data_formatting($data, $multi_data = false)
    {
        $storage = [];
        $cuisines=[];

        if ($multi_data == true) {
            foreach ($data as $item) {
                $item->load('cuisine');
                // $item['coupons'] = $item->coupon_valid;
                $restaurant_id= (string)$item->id;

                $item['coupons'] = Coupon::Where(function ($q) use ($restaurant_id) {
                    $q->Where('coupon_type', 'restaurant_wise')->whereJsonContains('data', [$restaurant_id])
                        ->where(function ($q1)  {
                            $q1->WhereJsonContains('customer_id', ['all']);
                        });
                })->orwhere('restaurant_id',$restaurant_id)
                ->active()
                ->valid()
                ->get();
---
select `cuisines`.*, `cuisine_restaurant`.`restaurant_id` as `pivot_restaurant_id`, `cuisine_restaurant`.`cuisine_id` as `pivot_cuisine_id` from `cuisines` inner join `cuisine_restaurant` on `cuisines`.`id` = `cuisine_restaurant`.`cuisine_id` where `cuisine_restaurant`.`restaurant_id` in (163)