app/CentralLogics/product.php

select count(*) as aggregate from `food` where `restaurant_id` = '152' and exists (select * from `restaurants` where `food`.`restaurant_id` = `restaurants`.`id` and `zone_id` in (3) and `off_day` not like '%3%') and (`name` like '%%' or exists (select * from `tags` inner join `food_tag` on `tags`.`id` = `food_tag`.`tag_id` where `food`.`id` = `food_tag`.`food_id` and (`tag` like '%%'))) and `status` = 1 and exists (select * from `restaurants` where `food`.`restaurant_id` = `restaurants`.`id` and `status` = 1) and `recommended` = 1
---
    public static function recommended_products($zone_id,$restaurant_id,$limit = null, $offset = null, $type='all',$name=null)
    {
        $data =[];
        if($limit != null && $offset != null)
        {
            $paginator = Food::where('restaurant_id', $restaurant_id)->whereHas('restaurant', function($q)use($zone_id){
                $q->whereIn('zone_id', $zone_id)->Weekday();
            })
            ->when(isset($name) , function($query)use($name){
                $query->where(function ($q) use ($name) {
                    foreach ($name as $value) {
                        $q->orWhere('name', 'like', "%{$value}%");
                    }
                    $q->orWhereHas('tags',function($query)use($name){
                        $query->where(function($q)use($name){
                            foreach ($name as $value) {
                                $q->where('tag', 'like', "%{$value}%");
                            };
                        });
                    });
                });
            })
            ->active()->type($type)->Recommended()->paginate($limit, ['*'], 'page', $offset);