app/CentralLogics/restaurant.php

    public static function get_popular_restaurants($zone_id, $limit = 10, $offset = 1, $type='all',$longitude=0,$latitude=0 ,$veg = null ,$non_veg = null ,$discount = null,$top_rated = null)
    {
        $paginator = Restaurant::withOpen($longitude,$latitude)
        ->with(['reviews','discount'=>function($q){
            return $q->validate();
        }])->whereIn('zone_id', $zone_id)
		->where('is_popular', 1)
        ->when(isset($veg) && $veg == 1  , function($q) {
            $q->where('veg',1);
        })
        ->when(isset($non_veg) && $non_veg == 1   , function($q) {
            $q->where('non_veg',1);
        })
        ->when(isset($discount)  && $discount == 1  , function($q) {
            $q->whereHas('discount',function($query){
                return $query->validate();
            });
        })
        ->when(isset($top_rated) && $top_rated == 1 , function($query){
            $query->whereHas('reviews',function($q){
                $q->selectRaw('avg(reviews.rating) as avg_r')
                    ->having('avg_r', '>', 3);
            });
        })

        ->Active()
        ->type($type)
        ->withCount('orders')
        ->orderBy('open', 'desc')
        ->orderBy('orders_count', 'desc')
        ->limit(50)
        ->get();
---
select `reviews`.*, `food`.`restaurant_id` as `laravel_through_key` from `reviews` inner join `food` on `food`.`id` = `reviews`.`food_id` where `food`.`restaurant_id` in (7, 9, 15, 37, 39, 73, 79, 96, 136, 147, 150, 160, 168, 169, 171, 174, 175)

    public static function get_restaurant_details($restaurant_id)
    {
        return Restaurant::with(['discount'=>function($q){
            return $q->validate();
        }, 'campaigns', 'schedules','restaurant_sub'])->active()
        ->when(is_numeric($restaurant_id),function ($qurey) use($restaurant_id){
            $qurey-> where('id', $restaurant_id);
        })
        ->when(!is_numeric($restaurant_id),function ($qurey) use($restaurant_id){
            $qurey-> where('slug', $restaurant_id);
        })
        ->first();
---
select `campaigns`.*, `campaign_restaurant`.`restaurant_id` as `pivot_restaurant_id`, `campaign_restaurant`.`campaign_id` as `pivot_campaign_id` from `campaigns` inner join `campaign_restaurant` on `campaigns`.`id` = `campaign_restaurant`.`campaign_id` where `campaign_restaurant`.`restaurant_id` in (57)