app/Http/Controllers/Api/V1/CuisineController.php

select * from `cuisines` where `status` = 1
---
    public function get_all_cuisines()
    {
        $Cuisines = Cuisine::where('status',1)->get();