app/Http/Controllers/Api/V1/DeliverymanController.php

    public function get_profile(Request $request)
    {
        $dm = DeliveryMan::with(['rating','userinfo','dm_shift'])->where(['auth_token' => $request['token']])->first();
        $dm['avg_rating'] = (double)($dm?->rating[0]?->average ?? 0);
        $dm['rating_count'] = (double)($dm?->rating[0]?->rating_count ?? 0);
        $dm['order_count'] =(integer)$dm?->orders->count();
        $dm['todays_order_count'] =(integer)$dm->todaysorders->count();
        $dm['this_week_order_count'] =(integer)$dm->this_week_orders->count();
        $dm['member_since_days'] =(integer)$dm->created_at->diffInDays();
        $dm['cash_in_hands'] =(float) ($dm?->wallet?->collected_cash ?? 0);
        $dm['balance'] = (float) ($dm?->wallet?->total_earning - $dm?->wallet?->total_withdrawn ?? 0);
        $dm['todays_earning'] =(float)($dm?->todays_earning()?->sum('original_delivery_charge') + $dm?->todays_earning()?->sum('dm_tips'));
---
select * from `shifts` where `shifts`.`id` in (1)
select * from `user_infos` where `user_infos`.`deliveryman_id` in (6)
select * from `orders` where `orders`.`delivery_man_id` = 6 and `orders`.`delivery_man_id` is not null

    public function get_current_orders(Request $request)
    {
        $dm = DeliveryMan::where(['auth_token' => $request['token']])->first();
        $orders = Order::with(['customer', 'restaurant'])
        ->whereIn('order_status', ['accepted','confirmed','pending', 'processing', 'picked_up', 'handover'])
        ->where(['delivery_man_id' => $dm['id']])
        ->orderBy('accepted')
        ->orderBy('schedule_at', 'desc')
        ->Notpos()
        ->get();
---
select * from `orders` where `order_status` in ('accepted', 'confirmed', 'pending', 'processing', 'picked_up', 'handover') and (`delivery_man_id` = 6) and `order_type` <> 'pos' order by `accepted` asc, `schedule_at` desc
select * from `restaurants` where `restaurants`.`id` in (10)

    public function record_location_data(Request $request)
    {
        $dm = DeliveryMan::where(['auth_token' => $request['token']])->first();
        DB::table('delivery_histories')->insert([
            'delivery_man_id' => $dm['id'],
            'longitude' => $request['longitude'],
            'latitude' => $request['latitude'],
            'time' => now(),
            'location' => $request['location'],
            'created_at' => now(),
            'updated_at' => now()
        ]);
---
insert into `delivery_histories` (`delivery_man_id`, `longitude`, `latitude`, `time`, `location`, `created_at`, `updated_at`) values (6, 73.0264082, 19.1675379, '2023-12-06 22:03:37', '6, Konkan Division, IN', '2023-12-06 22:03:37', '2023-12-06 22:03:37')

    public function get_order(Request $request)
    {
        $validator = Validator::make($request->all(), [
            'order_id' => 'required'
        ]);
        if ($validator->fails()) {
            return response()->json(['errors' => Helpers::error_processor($validator)], 403);
        }
        $dm = DeliveryMan::where(['auth_token' => $request['token']])->first();

        $order = Order::with(['customer', 'restaurant','details'])->where('id', $request['order_id'])
        ->where(function($q)use($dm){
            $q->where('delivery_man_id', $dm['id'])
            ->orWhereHas('subscription_logs',function($query)use($dm){
                $query->where('delivery_man_id', $dm['id'])->whereIn('order_status', ['delivered','canceled','refund_requested','refunded','refund_request_canceled','failed']);
            });
        })
        ->Notpos()->first();
---
select * from `restaurants` where `restaurants`.`id` in (44)

    public function dm_shift(Request $request){
        $shift= Shift::where('status',1)
            ->latest()
            ->get();
---
select * from `shifts` where `status` = 1 order by `created_at` desc