app/Http/Controllers/Api/V1/OrderController.php

select * from `business_settings` where `key` = 'home_delivery' limit 1
---
        $distance_data = $request->distance ?? 0;


        $home_delivery = BusinessSetting::where('key', 'home_delivery')->first()?->value ?? null;

select * from `business_settings` where `key` = 'take_away' limit 1
---
            ], 403);
        }

        $take_away = BusinessSetting::where('key', 'take_away')->first()?->value ?? null;

select * from `business_settings` where `key` = 'cash_on_delivery' limit 1
---
            ], 403);
        }

        $settings =  BusinessSetting::where('key', 'cash_on_delivery')->first();

select * from `discounts` where `discounts`.`restaurant_id` in (1)
---
                ]
            ], 406);
        }
        $restaurant = Restaurant::with(['discount', 'restaurant_sub'])->selectRaw('*, IF(((select count(*) from `restaurant_schedule` where `restaurants`.`id` = `restaurant_schedule`.`restaurant_id` and `restaurant_schedule`.`day` = '.$schedule_at->format('w').' and `restaurant_schedule`.`opening_time` < "'.$schedule_at->format('H:i:s').'" and `restaurant_schedule`.`closing_time` >"'.$schedule_at->format('H:i:s').'") > 0), true, false) as open')->where('id', $request->restaurant_id)->first();

select count(*) as aggregate from `orders`
select * from `orders` where `orders`.`id` = 120202 limit 1
---

        $order_details = [];
        $order = new Order();
        $order->id = 120000 + Order::count() + 1;
        if (Order::find($order->id)) {

select * from `business_settings` where `key` = 'dm_tips_status' limit 1
---
        $order->scheduled = $request->schedule_at?1:0;
        $order->otp = rand(1000, 9999);
        $order->zone_id = $restaurant->zone_id;
        $dm_tips_manage_status = BusinessSetting::where('key', 'dm_tips_status')->first()->value;

select * from `restaurants` where `restaurants`.`id` in (10)
---
    public function get_running_orders(Request $request)
    {
        $validator = Validator::make($request->all(), [
            'limit' => 'required',
            'offset' => 'required',
        ]);
        if ($validator->fails()) {
            return response()->json(['errors' => Helpers::error_processor($validator)], 403);
        }

        $paginator = Order::with(['restaurant', 'delivery_man.rating'])->withCount('details')->where(['user_id' => $request->user()->id])
        ->whereNull('subscription_id')
        ->whereNotIn('order_status', ['delivered','canceled','refund_requested','refund_request_canceled','refunded','failed'])
        ->Notpos()->latest()->paginate($request['limit'], ['*'], 'page', $request['offset']);