app/Http/Controllers/Api/V1/Auth/CustomerAuthController.php

    public function register(Request $request)
    {
        /*
         'password' => ['required', Password::min(8)->mixedCase()->letters()->numbers()->symbols()->uncompromised()],
        */
        $validator = Validator::make($request->all(), [
            'f_name' => 'required',
            'l_name' => 'required',
            'email' => 'required|unique:users',
            'phone' => 'required|unique:users',
            'password' => 'required'


        ], [
            'f_name.required' => 'The first name field is required.',
            'l_name.required' => 'The last name field is required.',
        ]);

        if ($validator->fails()) {
            return response()->json(['errors' => Helpers::error_processor($validator)], 403);
        }
        $ref_by= null ;
        $customer_verification = BusinessSetting::where('key','customer_verification')->first()->value;
---
select * from `business_settings` where `key` = 'customer_verification' limit 1

            $ref_by= $referar_user->id;
        }

        $user = User::create([
            'f_name' => $request->f_name,
            'l_name' => $request->l_name,
            'email' => $request->email,
            'phone' => $request->phone,
            'ref_by' =>   $ref_by,
            'password' => bcrypt($request->password),
        ]);
        $user->ref_code = Helpers::generate_referer_code($user);
        $user->save();
---
insert into `users` (`f_name`, `l_name`, `email`, `phone`, `ref_by`, `password`, `updated_at`, `created_at`) values ('Niten', 'Solanki', 'ashvinniten02@gmail.com', '7984585052', '', '$2y$10$rpbz/NfcAcoB5pczI9IJJuz1YOuw4hsr./fdFQQHelH6qZw1DOayu', '2023-12-16 17:59:30', '2023-12-16 17:59:30')
update `users` set `ref_code` = 'AFLGNC4GMH', `users`.`updated_at` = '2023-12-16 17:59:30' where `id` = 513

    public function login(Request $request)
    {
        $validator = Validator::make($request->all(), [
            'phone' => 'required',
            'password' => 'required|min:6'
        ]);

        if ($validator->fails()) {
            return response()->json(['errors' => Helpers::error_processor($validator)], 403);
        }
        $data = [
            'phone' => $request->phone,
            'password' => $request->password
        ];

        $customer_verification = BusinessSetting::where('key','customer_verification')->first()->value;
---
select * from `business_settings` where `key` = 'customer_verification' limit 1