app/Http/Controllers/Api/V1/Auth/VendorLoginController.php

    public function login(Request $request)
    {

        $validator = Validator::make($request->all(), [
            'phone' => 'required',
            'password' => 'required|min:6'
        ]);

        if ($validator->fails()) {
            return response()->json(['errors' => Helpers::error_processor($validator)], 403);
        }

        $data = [
            'phone' => $request->phone,
            'password' => $request->password
        ];

        if (auth('vendor')->attempt($data)) {
            $token = $this->genarate_token($request['phone']);
            $vendor = Vendor::where(['phone' => $request['phone']])->first();
---
select * from `vendors` where (`phone` = '7710984997') limit 1

                ], 200);
            }
            $vendor->auth_token = $token;
            $vendor?->save();
---
update `vendors` set `auth_token` = 'CGklYX4xnATLtIAyhpg1a2iPgc6amX8kDmwqqeVAzLb80FEkQcYkXw1AruNfv8BAlYIy2D8rlrj71Lp1QPFrXXSAd2bjIXUfsgS5nXnW5YefGKfJdD8hf1pd', `vendors`.`updated_at` = '2023-12-16 17:35:20' where `id` = 1

    private function genarate_token($email)
    {
        $token = Str::random(120);
        $is_available = Vendor::where('auth_token', $token)->where('email', '!=', $email)->count();
---
select count(*) as aggregate from `vendors` where `auth_token` = 'CGklYX4xnATLtIAyhpg1a2iPgc6amX8kDmwqqeVAzLb80FEkQcYkXw1AruNfv8BAlYIy2D8rlrj71Lp1QPFrXXSAd2bjIXUfsgS5nXnW5YefGKfJdD8hf1pd' and `email` != '7710984997'