app/Http/Controllers/Api/V1/Vendor/VendorController.php

    public function get_profile(Request $request)
    {
        $vendor = $request['vendor'];
        $restaurant = Helpers::restaurant_data_formatting(data:$vendor->restaurants[0], multi_data:false);
        $discount=Helpers::get_restaurant_discount(restaurant: $vendor->restaurants[0]);
        unset($restaurant['discount']);
        $restaurant['discount']=$discount;
        $restaurant['schedules']=$restaurant?->schedules()?->get();

        $vendor['order_count'] =$vendor?->orders?->count();
        $vendor['todays_order_count'] =$vendor?->todaysorders?->count();
        $vendor['this_week_order_count'] =$vendor?->this_week_orders?->count();
        $vendor['this_month_order_count'] =$vendor?->this_month_orders?->count();
        $vendor['member_since_days'] =$vendor?->created_at?->diffInDays();
        $vendor['cash_in_hands'] =(float)$vendor?->wallet?->collected_cash ?? 0;
        $vendor['balance'] = (float)$vendor?->wallet?->balance ?? 0;
        $vendor['total_earning']  = (float)$vendor?->wallet?->total_earning ?? 0;
        $vendor['todays_earning'] =(float)$vendor?->todays_earning()?->sum('restaurant_amount');
        $vendor['this_week_earning'] =(float)$vendor?->this_week_earning()?->sum('restaurant_amount');
        $vendor['this_month_earning'] =(float)$vendor?->this_month_earning()?->sum('restaurant_amount');
        $vendor["restaurants"] = $restaurant;
        $vendor['userinfo'] = $vendor?->userinfo;

        $st = Restaurant::withoutGlobalScope('translate')->findOrFail($restaurant['id']);
---
select * from `restaurants` where `restaurants`.`vendor_id` = 163 and `restaurants`.`vendor_id` is not null
select * from `restaurants` where `restaurants`.`id` = 163 limit 1

    public function get_current_orders(Request $request)
    {
        $vendor = $request['vendor'];

        $restaurant=$vendor?->restaurants[0];
        $data =0;
        if (($restaurant?->restaurant_model == 'subscription' && $restaurant?->restaurant_sub?->self_delivery == 1)  || ($restaurant?->restaurant_model == 'commission' &&  $restaurant?->self_delivery_system == 1) ){
         $data =1;
        }

        $orders = Order::whereHas('restaurant.vendor', function($query) use($vendor){
            $query->where('id', $vendor->id);
        })
        ->with('customer')
        ->where(function($query)use($data){
            if(config('order_confirmation_model') == 'restaurant' || $data)
            {
                $query->whereIn('order_status', ['accepted','pending','confirmed', 'processing', 'handover','picked_up'])
                ->hasSubscriptionInStatus(['accepted','pending','confirmed', 'processing', 'handover','picked_up']);
            }
            else
            {
                $query->whereIn('order_status', ['confirmed', 'processing', 'handover','picked_up'])
                ->hasSubscriptionInStatus(['accepted','pending','confirmed', 'processing', 'handover','picked_up'])
                ->orWhere(function($query){
                    $query->where('payment_status','paid')->where('order_status', 'accepted');
                })
                ->orWhere(function($query){
                    $query->where('order_status','pending')->where('order_type', 'take_away');
                });
            }
        })
        ->NotDigitalOrder()
        ->Notpos()
        ->orderBy('schedule_at', 'desc')
        ->get();
---
select * from `restaurants` where `restaurants`.`vendor_id` = 106 and `restaurants`.`vendor_id` is not null
select * from `orders` where exists (select * from `restaurants` where `orders`.`restaurant_id` = `restaurants`.`id` and exists (select * from `vendors` where `restaurants`.`vendor_id` = `vendors`.`id` and `id` = 106)) and (`order_status` in ('confirmed', 'processing', 'handover', 'picked_up') or (exists (select * from `subscription_logs` where `orders`.`id` = `subscription_logs`.`order_id` and `order_status` in ('accepted', 'pending', 'confirmed', 'processing', 'handover', 'picked_up'))) or (`payment_status` = 'paid' and `order_status` = 'accepted') or (`order_status` = 'pending' and `order_type` = 'take_away')) and `payment_method` != 'digital_payment' and `order_type` <> 'pos' order by `schedule_at` desc

        }
        $order->order_status = $request['status'];
        $order[$request['status']] = now();
        $order->save();
---
update `orders` set `order_status` = 'handover', `handover` = '2023-12-06 16:51:21', `orders`.`updated_at` = '2023-12-06 16:51:21' where `id` = 120097

    public function withdraw_list(Request $request)
    {
        $withdraw_req = WithdrawRequest::where('vendor_id', $request['vendor']->id)->latest()->get();
---
select * from `withdraw_requests` where `vendor_id` = 165 order by `created_at` desc