app/Http/Controllers/Admin/BannerController.php

select * from `banners` order by `created_at` desc limit 25 offset 0
select count(*) as aggregate from `banners`
---
    function index()
    {
        $banners = Banner::latest()->paginate(config('default_pagination'));

select * from `banners` where `banners`.`id` = '27' limit 1
update `banners` set `status` = '1', `banners`.`updated_at` = '2023-12-06 17:54:09' where `id` = 27
---
    public function status(Request $request)
    {
        $banner = Banner::findOrFail($request->id);
        $banner->status = $request->status;
        $banner->save();