app/Http/Controllers/Admin/VendorController.php

    public function get_restaurants(Request $request)
    {
        $zone_ids = isset($request->zone_ids) ? (count($request->zone_ids) > 0 ? $request->zone_ids : []) : 0;
        $data = Restaurant::

        when($zone_ids, function($query) use($zone_ids){
            $query->whereIn('restaurants.zone_id', $zone_ids);
        })

        ->where('restaurants.name', 'like', '%'.$request->q.'%')
        ->limit(8)->get()
        ->map(function ($restaurant) {
            return [
                'id' => $restaurant->id,
                'text' => $restaurant->name . ' (' . $restaurant->zone?->name . ')',
            ];
        });
---
select * from `restaurants` where `restaurants`.`name` like '%Y%' limit 8