app/Http/Controllers/Admin/ZoneController.php

select *,ST_AsText(ST_Centroid(`coordinates`)) as center from `zones` where `zones`.`id` = '3' limit 1
---
    public function get_coordinates($id){
        $zone=Zone::withoutGlobalScopes()->selectRaw("*,ST_AsText(ST_Centroid(`coordinates`)) as center")->findOrFail($id);